# Вычислить значение выражения:
# 12 + 15
# 12 / 15
# 112 * 15

# 1. Определить где операторы?
# 2. Где числовые значения?

# Уровень 1:

# - 1 действие
# - 2 аргумента

# Уровень 2:

# - Количество действий произовльное
# 12 + 15 - 4

# Уровень 3:

# - Действия имеют приоритет
# 12 - 4 * 2

# Уровень 4:

# - Действия разделяются скобками
# (12 - 4) * 2

# lst = [6600, '-', 14, '+', 100]

# a = lst.split()

# m = '(12 - 4)*2'
# m2 = []

# m = m.replace(')', ' ) ')
# m = m.replace('(', ' ( ')
# lst = m.split()

# print(lst)

# m = ['(', '12', '-', '4', ')', '*', '2']
# print(m[1], m[2], m[3])